"use client";
import React, { useState } from "react";
import "@/app/money/money.css";
import Container from "@/component/container/container";
import "@/app/neo-wave/neo-wave.css";

// تعریف ساختار منو با id و label
const menuData = {
  main: [
    { id: "rule1", label: "کمتر از 38.2" },
    { id: "rule2", label: "حداقل 38.2 و کمتر از 61.8" },
    { id: "rule3", label: "دقیقا 61.8" },
    { id: "rule4", label: "بین 61.8 و 100" },
    { id: "rule5", label: "حداقل 100 ولی کمتر از 161.8" },
    { id: "rule6", label: "بین 161.8 و 261.8 شامل دو حد" },
    { id: "rule7", label: "بیش از 261.8" },
  ],
  rule1: [
    { id: "r1a", label: "کمتر از 61.8" },
    { id: "r1b", label: "حداقل 61.8 و کمتر از 100" },
    { id: "r1c", label: "مابین 100 و 161.8 شامل دو حد" },
    { id: "r1d", label: "بیش از 161.8 شامل خود حد" },
  ],
  r1a: [
    {
      id: "r1ai",
      label:
        "اگر ام2 مدت زمانی مساوی یا بیشتر نسبت به ام 1 را به خود اختصاص داد یا ام2 مدت زمانی مساوی یا بیشتر را نسبت به ام3 صرف نمود، یک :5 در پایان ام1 قرار دهید",
    },

    {
      id: "r1aii",
      label:
        "اگر طول ام-1 بین 100 تا 161.8 شامل دو حد از ام0 است و ام0 خیلی نزدیک به 61.8 از ام1 است و ام4 از انتهای ام0 تجاوز نکرده است، ممکن است ام1 یک الگوی تخت در درون آرایشی پیچیده را تکمیل کند که در آن ام2 یک ایکس موج :سی3 است؛ :اس5 را در انتهای ام1 قراردهید",
    },
    {
      id: "r1aiii",
      label:
        "اگر ام0 متشکل از بیش از 3 تک موج است و ام1 تمام طول ام0 را مدت زمانی مساوی با یا کمتر از شکل گیری ام0 طی نمود، ام0 احتمالا خاتمه ی یک الگوی مهم الیوت است",
    },
    {
      id: "r1aiv",
      label:
        "اگر ام0 و ام2 تقریبا به لحاظ زمانی و قیمتی برابر هستند یا در عوض نسبت 61.8 میانشان برقرار است و ام-1 نسبت به ام1، 161.8 یا بیشتر است و ام3 یا از ام3 تا ام5 در مدت زمانی مساوی یا کمتر از آنچه توسط ام-1 صرف شده به بلندای قیمتی مساوی با یا بزرگتر از ام-1 نایل شد، احتمالا یک الگوی تصحیحی جاری از هر نوعی دارد آشکار می شود، یک :سی3 پس از :5 قبلی اضافه کنید. اگر این تصحیحی جاری از نوع ساده است. تقریبا با قاطعیت میتوان گفت مه از آغاز ام0 شروع شده و تا پایان ام2 را شامل می شود که ام1 موج بی در این الگوی تصحیحی است. برای اینکه این الگوی تصحیحی جاری از نوع پیچیده ی دوگانه ی سه تایی باشد، ام-2 بایستی کوتاه تر از ام-1 باشد در این وضعیت ، آرایش مذکور احتمالا از ام-2 آغاز شده و شامل ام4 نیز می شود که در این میان ام 1 ایکس موج در آن آرایش ایکس:سی3 خواهد شد",
    },
    {
      id: "r1av",
      label:
        "اگر ام0 و ام2 تقریبا در قیمت و زمان با هم برابرند یا با نسبت 61.8 به هم مرتبط هستند و ام-1 کمتر از 161.8 از ام1 است و ام-1 بزرگتر از ام0 است و ام3 یا ام5 161.8 یا بیشتر از ام1 است، احتمالا یک تصحیحی جاری از هر نوعی، شامل بیش از یک الگو، در حال شکل گیری است؛ یک :سی3 پس از :5 که در انتهای ام1 گذاشته بودید اضافه کنید. اگر ام-2 بلند تر از ام-1 است، به آنچه که اکنون ام-1 است برگردید و :اس ال3 را به فهرست ساختاری آن اضافه کنید. چنانچه تصحیحی جاری از نوع ساده است، به احتمال زیاد از ابتدای ام0 آغاز شده است و تا انتهای ام2 را شامل می شودکه ام1 موج بی در این الگوی تصحیحی خواهد بود. برای اینکه آن الگوی تصحیحی جاری از نوع پیچیده ی دوگانه سه تایی باشد ام-2 بایستی کوتاهتر از ام-1 و ام3 نباید بیش از 161.8 از ام1 باشد؛ تحت این شرایط خاص، فرآیند احتمالا با ام-2 آغاز شده و شامل ام4 می باشد که در این میان ام1 ایکس موج خواهد بود یک ایکس در جلوی :سی 3 اضافه کنید ",
    },
    {
      id: "r1avi",
      label:
        "اگر ام0 و ام2 تقریباً از نظر زمان و قیمت برابر هستند یا با نسبت 61.8 به هم مرتبط هستند و ام3 کمتر از 161.8 از ام1 است و ام3 به اضافه ی یک واحد زمانی در همان مدت زمانی که شکل گرفته بود یا کمتر از آن به طور کامل بازگشت شده است ام1 میتواند بخشی از یک تصحیح پیچیده باشد که استفاده از برچسب پیشرفت ایکس موج را الزامی میکند ایکس موج مذکور باید در یکی از این دو موقعیت باشد؛ در پایان ام0 یا مخفی از دید ما یعنی مفقود در مرکز ام1.  برای آگاهی از این دو احتمال مداد را برداشته و ایکس:سی3 را در سمت چپ :اس5 قرار دهید. اگر (ام-2) بلندتر از (ام-1) باشد ایکس موج در انتهای ام0 جای ندارد پس آن احتمال را حذف کنید. اگر طول ام3 کمتر از 61.8% از ام1 است احتمالات ممکن به طرز وحشتناکی چرخش میکند به سمت اینکه ایکس موج در مرکز ام1 پنهان شده باشد",
    },
    {
      id: "r1avi",
      label:
        "اگر ام0 و ام2 آشکارا از نظر زمانی و مکانی یا هر دو با یکدیگر متفاوت هستند و ام0 و ام2 هیچ دامنه ی قیمتی مشترکی را ندارند و ام1 در قیاس با (ام-1) و ام3 کوچکترین در بین این سه نیست، ممکن است ام1 بخشی از یک الگوی رونددار شتاب دار بزرگتر باشد؛ اگر چنین بود، :5 که پیشتر قرار دادیم به کار خواهد آمد",
    },
  ],
  r1b: [
    {
      id: "r1bi",
      label:
        "یک :5 در انتهای ام1 قرار دهید. اگر طول (ام-1) بین 161.8-100 شامل دو حد از ام0 است و ام4 از انتهای ام0 تجاوز نکرده است ام1 میتواند تکمیل کننده ی یک الگوی تخت در درون یک آرایش پیچیده باشد که در آن ام2 یک ایکس موج است؛ در انتهای ام1 یک :5 و در انتهای ام2 یک ایکس:سی3 قرار دهید",
    },
    {
      id: "r1bii",
      label:
        "اگر ام0 متشکل از بیش از سه تک موج است و ام1 منهای یک واحد زمانی کل ام0 را در حجمی مشابه یا کمتر از زمان تشکیل ام0 بازگشت نموده است ام0 ممکن است خاتمه ی یک الگوی مهم الیوت باشد",
    },
    {
      id: "r1biii",
      label:
        "اگر بخشی از دامنه ی قیمتی ام2 که با ام0 و ام3 مشترک است در یک برش زمانی مساوی با یا کمتر از ام1 بلندتر و عمودی تر از ام1 است و (ام-1) بلندتر از ام1 است :اس ال 3 را به فهرست ساختاری ام1 اضافه کنید",
    },
    {
      id: "r1biv",
      label:
        "اگر بخشی از دامنه ی قیمتی ام2 که با ام0 و ام3 مشترک است در یک برش زمانی مساوی با یا کمتر از ام1 بلندتر و عمودی تر از ام1 است و (ام-1) کوتاه تر از ام1 است و ام0 و ام2 آشکارا از نظر زمانی یا قیمتی یا هر دو با هم متفاوت هستند و ام4 یا از ام4 تا ام6 در مدتی زمانی برابر با 50% از مدت زمان طی شده بین ام1 تا ام3 به ابتدای ام1 بازگردیده است امکان دارد که یک الگوی ترمینال از نوع موج 5 ممتد به وسیله ی ام3 تکمیل شده باشد؛ یک :سی 3 به فهرست ساختاری ام1 اضافه کنید.",
    },
    {
      id: "r1bv",
      label:
        "اگر ام3 کوتاه تر از ام1 است و بخشی از دامنه ی قیمتی ام2 که با ام0 و (ام-1) مشترک است بلندتر از ام0 و ام1 است و هنگام مقایسه با (ام-1) و ام3 کوچکترین این سه نیست و از انتهای ام3 بازار در مدت زمانی مساوی با 50% یا کمتر از زمان صرف شده از ام1 تا ام3 به ابتدای ام1 و فراتر از آن می رسد؛ :سی 3 را در انتهای ام1 یادداشت کنید",
    },
  ],
  r1c: [
    {
      id: "r1ci",
      label:
        "یک :5 در انتهای ام1 قرار دهید برای تصمیم گیری پیرامون هر گونه برچسب ساختار دیگری که احتمالاً بایستی اضافه شود توضیحات زیر را بخوانید.",
    },
    {
      id: "r1cii",
      label:
        "اگر ام0 و ام1 از نظر قیمتی تقریباً برابر هستند انحراف 10% مجاز است و ام0 و ام1 از نظر زمانی مساوی یا با نسبت %61.8 مرتبط هستند و ام3 بلندتر و تندتر از ام1 است و ام2 حداقل به اندازه ی ام0 یا ام1 زمان گرفته است و ام2 خیلی نزدیک به نسبت 38.2% از ام1 است و یکی از انتخاب ها برای برچسب ساختار ام0 :اف3 است پس [:سی3] را به فهرست ساختاری برای ام1 اضافه کنید. برای اینکه :سی3 یک انتخاب بهتر باشد ترجیح این است که ام2 در یکی از سطوح مهم قیمتی بر مبنای فیبوناچی نسبت به ml ام0، ام1 یا موج شتابدار قبلی که تک موج یا بالاتر باشد خاتمه بیابد. به خاطر بسپارید که یک :سی3 حتی تحت این شرایط باز هم یک انتخاب ریسکی است علت گذاشتن آن در براکت نیز همین است.",
    },
    {
      id: "r1ciii",
      label:
        "اگر ام3 بلندتر و عمودی تر از ام1 است و نیز ام3 کاملاً بازگشت شده یا ام3 کمتر از 61.8% بازگشت شده و ام2 خیلی نزدیک به 38.2% از ام1 است و یکی از انتخاب ها برای برچسب ساختار ام0 :سی3 است و (ام-3) بلندتر از (ام-2) است و (ام-2) یا (ام-1) بلندتر از ام0 است ام1 ممکن است شاخه ی یکی به آخر مانده ی یک مثلث انقباضی باشد؛ :اس ال3 به فهرست ساختاری اضافه کنید. به خاطر بسپارید که یک :اس ال3 حتی تحت این شرایط آرمانی باز هم یک برچسب ساختار نه چندان دلچسب نسبت به :5 است که پیشتر قرارداده بودیم علت وجود براکت دور آن نیز همین است.",
    },
  ],
  r1d:[
    {
      id:"r1di",
      label: "در این شرایط فقط یک احتمال وجود داذد، یک :5 در انتهای ام1 قرار دهید"
    },
  ],
  rule2: [
    { id: "r2a", label: "کمتر از 38.2" },
    { id: "r2b", label: "حداقل 38.2 و کمتر از 61.8" },
    { id: "r2c", label: "حداقل 61.8 ولی کمتر از 100" },
    { id: "r2d", label: "مابین 100 و 161.8 شامل دو حد" },
    { id: "r2e", label: "بیش از 161.8" },
  ],
};

const Page = () => {
  const [currentMenu, setCurrentMenu] = useState("main");
  const [history, setHistory] = useState([]);

  const handleSelect = (item) => {
    if (menuData[item.id]) {
      setHistory((prev) => [...prev, currentMenu]);
      setCurrentMenu(item.id);
    } else {
      alert(`گزینه انتخاب‌شده: ${item.label}`);
    }
  };

  const handleBack = () => {
    const prevMenu = history.pop();
    setCurrentMenu(prevMenu || "main");
    setHistory([...history]);
  };

  return (
    <Container>
      <div className="neo-menu">
        <div className="neo-content">
          {history.length > 0 && (
            <button className="back-button" onClick={handleBack}>
              برگشت
            </button>
          )}
          <div className="menu-item">
            {menuData[currentMenu]?.map((item) => (
              <div
                key={item.id}
                className="item"
                onClick={() => handleSelect(item)}
              >
                <p>{item.label}</p>
              </div>
            ))}
          </div>
        </div>
      </div>
    </Container>
  );
};

export default Page;
